'''Определить, сколько раз нужно разрезать пополам металличе-
скую нить длиной L = 0,1 м, чтобы ее длина уменьшилась до атома
import math'''
print(f"для этого понадобиться { -math.ceil(math.log(10**-9,2))} раз") 
